zommuter/esp-agents-firmware/examples/voice_chat/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.2 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"

#
# Bootloader config
#

#
# Application Rollback
#
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
# end of Application Rollback

#
# Log
#

#
# Format
#
CONFIG_BOOTLOADER_LOG_COLORS=y
# end of Format
# end of Log
# end of Bootloader config

#
# Serial flasher config
#
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
# end of Serial flasher config

#
# Partition Table
#
CONFIG_PARTITION_TABLE_CUSTOM=y
# end of Partition Table

#
# ESP Agent Setup Configuration
#
CONFIG_AGENT_SETUP_DEFAULT_AGENT_ID="friend"
# end of ESP Agent Setup Configuration

#
# ESP Speech Recognition
#

#
# Load Multiple Wake Words (WakeNet9)
#
CONFIG_SR_WN_WN9_HILEXIN=y
CONFIG_SR_WN_WN9_HIESP=y
# end of Load Multiple Wake Words (WakeNet9)
# end of ESP Speech Recognition

#
# ESP RainMaker App Wi-Fi Provisioning
#
CONFIG_APP_NETWORK_ASYNCHRONOUS_CONNECTION=y
CONFIG_APP_WIFI_PROV_COMPAT=n
# end of ESP RainMaker App Wi-Fi Provisioning

#
# Component config
#

#
# Bluetooth
#
CONFIG_BT_NIMBLE_ENABLED=y

#
# NimBLE Options
#

#
# General
#
CONFIG_BT_NIMBLE_MEM_ALLOC_MODE_EXTERNAL=y
# end of General

#
# Roles and Profiles
#
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
# end of Roles and Profiles
# end of NimBLE Options
# end of Bluetooth

#
# ESP PSRAM
#
CONFIG_SPIRAM=y

#
# SPI RAM config
#
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=0
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=262144
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_ALLOW_NOINIT_SEG_EXTERNAL_MEMORY=y
# end of SPI RAM config
# end of ESP PSRAM

#
# ESP System Settings
#
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
# end of ESP System Settings

#
# Wi-Fi
#
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=64
CONFIG_ESP_WIFI_CACHE_TX_BUFFER_NUM=64
CONFIG_ESP_WIFI_DYNAMIC_RX_MGMT_BUFFER=y
CONFIG_ESP_WIFI_TX_BA_WIN=16
CONFIG_ESP_WIFI_RX_BA_WIN=6
CONFIG_ESP_WIFI_IRAM_OPT=n
CONFIG_ESP_WIFI_RX_IRAM_OPT=n
# end of Wi-Fi

#
# FreeRTOS
#

#
# Kernel
#
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=3120
# end of Kernel
# end of FreeRTOS

#
# Log
#
CONFIG_LOG_VERSION_2=y

#
# Format
#
CONFIG_LOG_COLORS=y
# end of Format
# end of Log

#
# LWIP
#
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=64

#
# TCP
#
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=65535
CONFIG_LWIP_TCP_WND_DEFAULT=65535
CONFIG_LWIP_TCP_RECVMBOX_SIZE=64
CONFIG_LWIP_TCP_ACCEPTMBOX_SIZE=8
CONFIG_LWIP_TCP_OOSEQ_MAX_PBUFS=6
# end of TCP
# end of LWIP

#
# mbedTLS
#
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y

#
# mbedTLS v3.x related
#
CONFIG_MBEDTLS_SSL_KEEP_PEER_CERTIFICATE=n
# end of mbedTLS v3.x related

#
# Certificate Bundle
#
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_CMN=y
# end of Certificate Bundle
# end of mbedTLS

#
# ESP-MQTT Configurations
#
CONFIG_MQTT_USE_CUSTOM_CONFIG=y
CONFIG_MQTT_OUTBOX_DATA_ON_EXTERNAL_MEMORY=y
# end of ESP-MQTT Configurations

#
# TCP Transport
#

#
# Websocket
#
CONFIG_WS_BUFFER_SIZE=2048
# end of Websocket
# end of TCP Transport

#
# Audio Codec Configuration
#

#
# Audio Decoder Configuration
#
CONFIG_AUDIO_DECODER_AAC_SUPPORT=n
CONFIG_AUDIO_DECODER_G711_SUPPORT=n
CONFIG_AUDIO_DECODER_AMRNB_SUPPORT=n
CONFIG_AUDIO_DECODER_AMRWB_SUPPORT=n
CONFIG_AUDIO_DECODER_FLAC_SUPPORT=n
CONFIG_AUDIO_DECODER_VORBIS_SUPPORT=n
CONFIG_AUDIO_DECODER_ADPCM_SUPPORT=n
CONFIG_AUDIO_DECODER_ALAC_SUPPORT=n
CONFIG_AUDIO_DECODER_PCM_SUPPORT=n
CONFIG_AUDIO_DECODER_SBC_SUPPORT=n
CONFIG_AUDIO_DECODER_LC3_SUPPORT=n
# end of Audio Decoder Configuration

#
# Audio Simple Decoder Configuration
#
CONFIG_AUDIO_SIMPLE_DEC_WAV_SUPPORT=n
CONFIG_AUDIO_SIMPLE_DEC_M4A_SUPPORT=n
CONFIG_AUDIO_SIMPLE_DEC_TS_SUPPORT=n
# end of Audio Simple Decoder Configuration

#
# Audio Encoder Configuration
#
CONFIG_AUDIO_ENCODER_AAC_SUPPORT=n
CONFIG_AUDIO_ENCODER_G711_SUPPORT=n
CONFIG_AUDIO_ENCODER_AMRNB_SUPPORT=n
CONFIG_AUDIO_ENCODER_AMRWB_SUPPORT=n
CONFIG_AUDIO_ENCODER_ADPCM_SUPPORT=n
CONFIG_AUDIO_ENCODER_ALAC_SUPPORT=n
CONFIG_AUDIO_ENCODER_PCM_SUPPORT=n
CONFIG_AUDIO_ENCODER_SBC_SUPPORT=n
CONFIG_AUDIO_ENCODER_LC3_SUPPORT=n
# end of Audio Encoder Configuration
# end of Audio Codec Configuration

#
# ESP Audio Simple Player
#

#
# Audio Simple Player IO Stream
#
CONFIG_ESP_AUDIO_SIMPLE_PLAYER_HTTP_EN=n
CONFIG_ESP_AUDIO_SIMPLE_PLAYER_FILE_EN=n
# end of Audio Simple Player IO Stream
# end of ESP Audio Simple Player

#
# mmap file support format
#
CONFIG_MMAP_FILE_NAME_LENGTH=32
# end of mmap file support format

#
# ESP WebSocket client
#
CONFIG_ESP_WS_CLIENT_SEPARATE_TX_LOCK=y
# end of ESP WebSocket client

#
# mDNS
#

#
# MDNS Memory Configuration
#
CONFIG_MDNS_TASK_CREATE_FROM_SPIRAM=y
CONFIG_MDNS_MEMORY_ALLOC_SPIRAM=y
# end of MDNS Memory Configuration
# end of mDNS

#
# LVGL configuration
#

#
# Memory Settings
#
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_USE_CLIB_STRING=y
CONFIG_LV_USE_CLIB_SPRINTF=y
# end of Memory Settings

#
# Feature Configuration
#

#
# Asserts
#
CONFIG_LV_USE_ASSERT_STYLE=y
# end of Asserts
# end of Feature Configuration

#
# Font Usage
#

#
# Enable built-in fonts
#
CONFIG_LV_FONT_MONTSERRAT_20=y
# end of Enable built-in fonts
CONFIG_LV_FONT_FMT_TXT_LARGE=y
CONFIG_LV_USE_FONT_PLACEHOLDER=n
# end of Font Usage

#
# Widget Usage
#
CONFIG_LV_USE_ANIMIMG=n
CONFIG_LV_USE_CALENDAR=n
CONFIG_LV_USE_CHART=n
CONFIG_LV_USE_KEYBOARD=n
CONFIG_LV_USE_LED=n
CONFIG_LV_USE_LIST=n
CONFIG_LV_USE_MENU=n
CONFIG_LV_USE_MSGBOX=n
CONFIG_LV_USE_SPAN=n
CONFIG_LV_USE_SPINBOX=n
CONFIG_LV_USE_SPINNER=n
CONFIG_LV_USE_TABVIEW=n
CONFIG_LV_USE_TILEVIEW=n
CONFIG_LV_USE_WIN=n
# end of Widget Usage

#
# 3rd Party Libraries
#
CONFIG_LV_USE_LODEPNG=y
# end of 3rd Party Libraries

#
# Others
#
CONFIG_LV_USE_IMGFONT=y
# end of Others

#
# Examples
#
CONFIG_LV_BUILD_EXAMPLES=n
# end of Examples

#
# Demos
#
CONFIG_LV_BUILD_DEMOS=n
# end of Demos
# end of LVGL configuration
# end of Component config
CONFIG_IDF_EXPERIMENTAL_FEATURES=y

# Local relay — plain LAN, no TLS (see components/agent/priv_include/esp_agent_internal.h)
CONFIG_ESP_AGENT_API_ENDPOINT="zomni.local:8765"

# Enable AEC so mic does not pick up the speaker output during TTS playback
CONFIG_ENABLE_AEC=y
